{
    "title": "3D Planetary Visualizer",
    "author": "César Perales",
    "date": "October 10, 2024",
    "skills": [
        "Three.js",
        "WebGL",
        "React",
        "Python",
        "Flask",
        "RESTful API",
        "3D Post-processing",
        "NASA API"
    ],
    "repoUrl": "https://github.com/Jerimy2021/Project-CS3081",
    "content": [
        {
            "type": "header",
            "level": 2,
            "content": "Project Overview"
        },
        {
            "type": "text",
            "content": "This project is an interactive three-dimensional visualizer of stellar systems and planets that synthesizes real astronomical data with advanced 3D rendering techniques. The application enables users to explore various planetary systems, visualize the physical characteristics of celestial bodies, and access detailed scientific information for each entity."
        },
        {
            "type": "image",
            "url": "/assets/images/projects/particle_planet_dem.gif",
            "alt": "Planetary system visualization",
            "caption": "Interactive 3D visualization of a stellar system featuring realistic lighting effects."
        },
        {
            "type": "header",
            "level": 2,
            "content": "Technical Architecture"
        },
        {
            "type": "text",
            "content": "The project implements a comprehensive client-server architecture. The backend, developed with Python and Flask, provides a RESTful API serving structured planetary data and high-resolution textures. The frontend utilizes React for the user interface and Three.js for advanced 3D rendering, incorporating high-quality lighting effects such as God Rays and particle systems to simulate cosmic dust."
        },
        {
            "type": "code",
            "language": "javascript",
            "content": "// Excerpt from the 3D rendering system\nexport function addStellars(scene, stellars, planetsRef, composer, cameraRef) {\n    stellars.forEach((stellar) => {\n        const sphere = getStellarSphere(stellar);\n        \n        // Special effects for stellar bodies\n        if (stellar.star && stellar.star === true) {\n            const godRaysEffect = new GodRaysEffect(cameraRef, sphere, {\n                resolutionScale: 0.5,\n                density: 0.96,\n                decay: 0.93,\n                weight: 0.3,\n                samples: 60\n            });\n            composer.addPass(new EffectPass(cameraRef, godRaysEffect));\n        }\n        \n        // Particle system for space dust simulation\n        const dustGeometry = new THREE.SphereGeometry(0.01 * sphere.geometry.parameters.radius, 32, 32);\n        // ...\n    });\n}"
        },
        {
            "type": "header",
            "level": 2,
            "content": "Core Features"
        },
        {
            "type": "text",
            "content": "- Fluid 3D navigation across complete stellar systems.\n- Realistic lighting system featuring God Ray effects for stars.\n- Particle simulations representing cosmic dust surrounding planetary bodies.\n- Detailed planetary visualization utilizing HD textures based on authentic datasets.\n- Information panel providing precise scientific metrics for each celestial body.\n- Intuitive navigation controls for virtual space exploration.\n- Advanced visual effects including geometric wireframes and texture displacement."
        },
        {
            "type": "image",
            "url": "/assets/images/projects/panel_info_planeta.png",
            "alt": "Planetary information panel",
            "caption": "Detailed information panel displaying planetary specifications."
        },
        {
            "type": "header",
            "level": 2,
            "content": "Technical Challenges"
        },
        {
            "type": "text",
            "content": "A primary challenge involved optimizing 3D rendering performance while handling multiple celestial bodies with complex visual effects. I implemented adaptive Level of Detail (LOD) techniques and efficient particle systems to maintain a fluid user experience. Ensuring precise synchronization between the 2D interface (markers, info panels) and the 3D environment required creative solutions, such as calculating accurate projections from 3D coordinates to 2D screen space."
        },
        {
            "type": "code",
            "language": "javascript",
            "content": "// Projection of 3D coordinates to 2D screen space\nconst getCoordinates = (i) => {\n    let vectorCP = new THREE.Vector3();\n    vectorCP = vectorCP.subVectors(planetsRef.current[i].position, cameraRef.current.position);\n    vectorCP.setFromMatrixPosition(planetsRef.current[i].matrixWorld).project(cameraRef.current);\n\n    const coords = {x: 0, y: 0};\n    coords.x = (vectorCP.x + 1) / 2 * topCanvasRef.current.clientWidth;\n    coords.y = (1 - vectorCP.y) / 2 * topCanvasRef.current.clientHeight;\n\n    return coords;\n}"
        },
        {
            "type": "header",
            "level": 2,
            "content": "Key Learnings"
        },
        {
            "type": "text",
            "content": "This project facilitated a deep dive into high-performance 3D web application development. I gained proficiency in optimizing complex scenes, implementing post-processing effects like God Rays, and creating dynamic particle systems. Integrating React with Three.js taught me effective patterns for managing component lifecycles with 3D rendering and using refs to control visual state. Additionally, I gained valuable experience architecting RESTful APIs to serve structured data and static assets."
        },
        {
            "type": "text",
            "content": "The implementation of custom camera controls and an object selection system via raycasting provided a profound understanding of applied 3D mathematics and human-computer interaction in three-dimensional environments."
        },
        {
            "type": "header",
            "level": 2,
            "content": "Conclusions"
        },
        {
            "type": "text",
            "content": "The 3D Planetary Visualizer demonstrates the feasibility of creating educational and visually compelling interactive experiences by merging scientific data with modern web technologies. Utilizing WebGL and Three.js allows complex scientific visualizations to be delivered directly to the browser, making virtual space exploration accessible to anyone with an internet connection. This project establishes a solid foundation for future iterations, including expanded stellar catalogs, high-fidelity physical simulations, and Virtual Reality (VR) experiences."
        }
    ]
}
